int update_status(int arr[3][3])
{
	for (int i = 0; i < 3; ++i)
	{
		if ((arr[i][0] == 1 && arr[i][1] == 1 && arr[i][2] == 1) ||
			(arr[0][i] == 1 && arr[1][i] == 1 && arr[2][i] == 1))
		{
			return 1; // °¡·Î, ¼¼·Î(Â÷·Ê´ë·Î) ½Â¸®
		}
	}
	if ((arr[0][0] == 1 && arr[1][1] == 1 && arr[2][2] == 1) ||
		(arr[0][2] == 1 && arr[1][1] == 1 && arr[2][0] == 1))
	{
		return 1; // ´ë°¢¼± ½Â¸® (2°³)
	}

	for (int i = 0; i < 3; ++i)
	{
		if ((arr[i][0] == 2 && arr[i][1] == 2 && arr[i][2] == 2) ||
			(arr[0][i] == 2 && arr[1][i] == 2 && arr[2][i] == 2))
		{
			return 1; // °¡·Î, ¼¼·Î(Â÷·Ê´ë·Î) ½Â¸®
		}
	}
	if ((arr[0][0] == 2 && arr[1][1] == 2 && arr[2][2] == 2) ||
		(arr[0][2] == 2 && arr[1][1] == 2 && arr[2][0] == 2))
	{
		return 1; // ´ë°¢¼± ½Â¸® (2°³)
	}
	return 0;
}